<?php require_once "../app.php"; ?>
<!-- 
    طبعا لازم استدعى نيم سبيس بتاع الكارت الاول خالص
    باتاكد ان فى اى دى خاص بالمنتج موجود فى السيشن
وبعدين اعمل اوبجيكت من الكلاس بتاع الكارت
واعمل فانكشن داخل كلاس الكارت واستدعيها هنا واديلها الاى دى اللى لاقيته 
واعمل بعد كدة اعادة توجية لصفحة الكارت تانى اللى انا واقف عليها اصلا
 -->
<?php

use techstore\Classes\Cart;

if($request->getHas('id')) {
    $id = $request->get('id');
    $cart = new Cart;
    $cart->remove($id);
    $request->redirect("cart.php");
}

?>